setAnalysisMode -analysisType single -checkType setup -clkSrcPath false -clockPropagation forcedIdeal -virtualIPO false
setExtractRCMode  -engine default
setDelayCalMode -engine default
setNanoRouteMode -quiet -routeSiEffort "low"
setNanoRouteMode -quiet -routeWithSiDriven false
setNanoRouteMode -quiet -routeWithTimingDriven false

setPlaceMode -fp false -ignoreScan true -timingDriven false
setImportMode -config true -keepEmptyModule true -treatUndefinedCellAsBbox false -useLefDef56 true
