###################################################################

# Created by write_sdc on Thu Apr 28 22:30:59 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_load -pin_load 1 [get_ports dataOut]
set_load -pin_load 1 [get_ports {Bdata[11]}]
set_load -pin_load 1 [get_ports {Bdata[10]}]
set_load -pin_load 1 [get_ports {Bdata[9]}]
set_load -pin_load 1 [get_ports {Bdata[8]}]
set_load -pin_load 1 [get_ports {Bdata[7]}]
set_load -pin_load 1 [get_ports {Bdata[6]}]
set_load -pin_load 1 [get_ports {Bdata[5]}]
set_load -pin_load 1 [get_ports {Bdata[4]}]
set_load -pin_load 1 [get_ports {Bdata[3]}]
set_load -pin_load 1 [get_ports {Bdata[2]}]
set_load -pin_load 1 [get_ports {Bdata[1]}]
set_load -pin_load 1 [get_ports {Bdata[0]}]
set_load -pin_load 1 [get_ports {Gdata[11]}]
set_load -pin_load 1 [get_ports {Gdata[10]}]
set_load -pin_load 1 [get_ports {Gdata[9]}]
set_load -pin_load 1 [get_ports {Gdata[8]}]
set_load -pin_load 1 [get_ports {Gdata[7]}]
set_load -pin_load 1 [get_ports {Gdata[6]}]
set_load -pin_load 1 [get_ports {Gdata[5]}]
set_load -pin_load 1 [get_ports {Gdata[4]}]
set_load -pin_load 1 [get_ports {Gdata[3]}]
set_load -pin_load 1 [get_ports {Gdata[2]}]
set_load -pin_load 1 [get_ports {Gdata[1]}]
set_load -pin_load 1 [get_ports {Gdata[0]}]
set_load -pin_load 1 [get_ports {Rdata[11]}]
set_load -pin_load 1 [get_ports {Rdata[10]}]
set_load -pin_load 1 [get_ports {Rdata[9]}]
set_load -pin_load 1 [get_ports {Rdata[8]}]
set_load -pin_load 1 [get_ports {Rdata[7]}]
set_load -pin_load 1 [get_ports {Rdata[6]}]
set_load -pin_load 1 [get_ports {Rdata[5]}]
set_load -pin_load 1 [get_ports {Rdata[4]}]
set_load -pin_load 1 [get_ports {Rdata[3]}]
set_load -pin_load 1 [get_ports {Rdata[2]}]
set_load -pin_load 1 [get_ports {Rdata[1]}]
set_load -pin_load 1 [get_ports {Rdata[0]}]
create_clock [get_ports reCLK]  -period 10  -waveform {0 5}
group_path -name FEEDTHROUGH  -from [list [get_ports reData] [get_ports globalReset] [get_ports {REF16Bits[15]}] [get_ports {REF16Bits[14]}] [get_ports {REF16Bits[13]}] [get_ports {REF16Bits[12]}] [get_ports {REF16Bits[11]}] [get_ports {REF16Bits[10]}] [get_ports {REF16Bits[9]}] [get_ports {REF16Bits[8]}] [get_ports {REF16Bits[7]}] [get_ports {REF16Bits[6]}] [get_ports {REF16Bits[5]}] [get_ports {REF16Bits[4]}] [get_ports {REF16Bits[3]}] [get_ports {REF16Bits[2]}] [get_ports {REF16Bits[1]}] [get_ports {REF16Bits[0]}] [get_ports {REF6Bit[5]}] [get_ports {REF6Bit[4]}] [get_ports {REF6Bit[3]}] [get_ports {REF6Bit[2]}] [get_ports {REF6Bit[1]}] [get_ports {REF6Bit[0]}]]  -to [list [get_ports dataOut] [get_ports {Bdata[11]}] [get_ports {Bdata[10]}] [get_ports {Bdata[9]}] [get_ports {Bdata[8]}] [get_ports {Bdata[7]}] [get_ports {Bdata[6]}] [get_ports {Bdata[5]}] [get_ports {Bdata[4]}] [get_ports {Bdata[3]}] [get_ports {Bdata[2]}] [get_ports {Bdata[1]}] [get_ports {Bdata[0]}] [get_ports {Gdata[11]}] [get_ports {Gdata[10]}] [get_ports {Gdata[9]}] [get_ports {Gdata[8]}] [get_ports {Gdata[7]}] [get_ports {Gdata[6]}] [get_ports {Gdata[5]}] [get_ports {Gdata[4]}] [get_ports {Gdata[3]}] [get_ports {Gdata[2]}] [get_ports {Gdata[1]}] [get_ports {Gdata[0]}] [get_ports {Rdata[11]}] [get_ports {Rdata[10]}] [get_ports {Rdata[9]}] [get_ports {Rdata[8]}] [get_ports {Rdata[7]}] [get_ports {Rdata[6]}] [get_ports {Rdata[5]}] [get_ports {Rdata[4]}] [get_ports {Rdata[3]}] [get_ports {Rdata[2]}] [get_ports {Rdata[1]}] [get_ports {Rdata[0]}]]
group_path -name REGIN  -from [list [get_ports reData] [get_ports globalReset] [get_ports {REF16Bits[15]}] [get_ports {REF16Bits[14]}] [get_ports {REF16Bits[13]}] [get_ports {REF16Bits[12]}] [get_ports {REF16Bits[11]}] [get_ports {REF16Bits[10]}] [get_ports {REF16Bits[9]}] [get_ports {REF16Bits[8]}] [get_ports {REF16Bits[7]}] [get_ports {REF16Bits[6]}] [get_ports {REF16Bits[5]}] [get_ports {REF16Bits[4]}] [get_ports {REF16Bits[3]}] [get_ports {REF16Bits[2]}] [get_ports {REF16Bits[1]}] [get_ports {REF16Bits[0]}] [get_ports {REF6Bit[5]}] [get_ports {REF6Bit[4]}] [get_ports {REF6Bit[3]}] [get_ports {REF6Bit[2]}] [get_ports {REF6Bit[1]}] [get_ports {REF6Bit[0]}]]
group_path -name REGOUT  -to [list [get_ports dataOut] [get_ports {Bdata[11]}] [get_ports {Bdata[10]}] [get_ports {Bdata[9]}] [get_ports {Bdata[8]}] [get_ports {Bdata[7]}] [get_ports {Bdata[6]}] [get_ports {Bdata[5]}] [get_ports {Bdata[4]}] [get_ports {Bdata[3]}] [get_ports {Bdata[2]}] [get_ports {Bdata[1]}] [get_ports {Bdata[0]}] [get_ports {Gdata[11]}] [get_ports {Gdata[10]}] [get_ports {Gdata[9]}] [get_ports {Gdata[8]}] [get_ports {Gdata[7]}] [get_ports {Gdata[6]}] [get_ports {Gdata[5]}] [get_ports {Gdata[4]}] [get_ports {Gdata[3]}] [get_ports {Gdata[2]}] [get_ports {Gdata[1]}] [get_ports {Gdata[0]}] [get_ports {Rdata[11]}] [get_ports {Rdata[10]}] [get_ports {Rdata[9]}] [get_ports {Rdata[8]}] [get_ports {Rdata[7]}] [get_ports {Rdata[6]}] [get_ports {Rdata[5]}] [get_ports {Rdata[4]}] [get_ports {Rdata[3]}] [get_ports {Rdata[2]}] [get_ports {Rdata[1]}] [get_ports {Rdata[0]}]]
set_input_delay -clock reCLK  1  [get_ports reData]
set_input_delay -clock reCLK  1  [get_ports globalReset]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[15]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[14]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[13]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[12]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[11]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[10]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[9]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[8]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[7]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[6]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[5]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[4]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[3]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[2]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[1]}]
set_input_delay -clock reCLK  1  [get_ports {REF16Bits[0]}]
set_input_delay -clock reCLK  1  [get_ports {REF6Bit[5]}]
set_input_delay -clock reCLK  1  [get_ports {REF6Bit[4]}]
set_input_delay -clock reCLK  1  [get_ports {REF6Bit[3]}]
set_input_delay -clock reCLK  1  [get_ports {REF6Bit[2]}]
set_input_delay -clock reCLK  1  [get_ports {REF6Bit[1]}]
set_input_delay -clock reCLK  1  [get_ports {REF6Bit[0]}]
set_output_delay -clock reCLK  1  [get_ports dataOut]
set_output_delay -clock reCLK  1  [get_ports {Bdata[11]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[10]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[9]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[8]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[7]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[6]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[5]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[4]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[3]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[2]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[1]}]
set_output_delay -clock reCLK  1  [get_ports {Bdata[0]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[11]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[10]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[9]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[8]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[7]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[6]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[5]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[4]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[3]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[2]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[1]}]
set_output_delay -clock reCLK  1  [get_ports {Gdata[0]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[11]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[10]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[9]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[8]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[7]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[6]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[5]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[4]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[3]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[2]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[1]}]
set_output_delay -clock reCLK  1  [get_ports {Rdata[0]}]
set_input_transition -max 0.1  [get_ports reData]
set_input_transition -min 0.1  [get_ports reData]
set_input_transition -max 0.1  [get_ports globalReset]
set_input_transition -min 0.1  [get_ports globalReset]
set_input_transition -max 0.1  [get_ports {REF16Bits[15]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[15]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[14]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[14]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[13]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[13]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[12]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[12]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[11]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[11]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[10]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[10]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[9]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[9]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[8]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[8]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[7]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[7]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[6]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[6]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[5]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[5]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[4]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[4]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[3]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[3]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[2]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[2]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[1]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[1]}]
set_input_transition -max 0.1  [get_ports {REF16Bits[0]}]
set_input_transition -min 0.1  [get_ports {REF16Bits[0]}]
set_input_transition -max 0.1  [get_ports {REF6Bit[5]}]
set_input_transition -min 0.1  [get_ports {REF6Bit[5]}]
set_input_transition -max 0.1  [get_ports {REF6Bit[4]}]
set_input_transition -min 0.1  [get_ports {REF6Bit[4]}]
set_input_transition -max 0.1  [get_ports {REF6Bit[3]}]
set_input_transition -min 0.1  [get_ports {REF6Bit[3]}]
set_input_transition -max 0.1  [get_ports {REF6Bit[2]}]
set_input_transition -min 0.1  [get_ports {REF6Bit[2]}]
set_input_transition -max 0.1  [get_ports {REF6Bit[1]}]
set_input_transition -min 0.1  [get_ports {REF6Bit[1]}]
set_input_transition -max 0.1  [get_ports {REF6Bit[0]}]
set_input_transition -min 0.1  [get_ports {REF6Bit[0]}]
